In [1]:
"""replace any space and special characters(, \ ") with space"""
import regex as re
import pandas as pd

In [2]:
products = pd.read_csv("data/products.csv")
products.head(2)

   product_id                product_name  aisle_id  department_id
0           1  Chocolate Sandwich Cookies        61             19
1           2            All-Seasons Salt       104             13

In [3]:
products[products.product_name.str.contains(',|\"')]

,product_id,product_name,aisle_id,department_id
29,30,"Three Cheese Ziti, Marinara with Meatballs",38,1
47,48,"School Glue, Washable, No Run",87,17
66,67,"Jelly, Blackberry",88,13
67,68,"Pancake Mix, Buttermilk",130,14
74,75,"Hemp Protein, Organic",65,11
...,...,...,...,...
49638,49639,"Pecans, Maple, Premium Blend",117,19
49640,49641,"8\"" Pecan Pie",100,21
49651,49652,"Drain Cleaner, Fresh Citrus & Sage Fragrance",114,17
49653,49654,"Teriyaki Sauce, Sesame, Original",5,13
49683,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5

In [4]:
def replace_with_(str):
    str = re.sub("[^A-Za-z0-9]+", " ",str)
    str = re.sub(",", " ", str)
    return str

In [5]:
print(replace_with_('Scotch Kids 5\" Scissors, Blunted, Red'))

Scotch Kids 5 Scissors Blunted Red

In [6]:
# products_regex = products[replace_with_(products.product_name)]
products['new_product_name'] = products.product_name.apply(replace_with_)

In [7]:
products_new = products[["product_id","new_product_name","aisle_id","department_id"]]
products_new.head(2)

   product_id            new_product_name  aisle_id  department_id
0           1  Chocolate Sandwich Cookies        61             19
1           2            All Seasons Salt       104             13

In [8]:
products_new[products_new.new_product_name.str.contains(',|\"')]

Empty DataFrame
Columns: [product_id, new_product_name, aisle_id, department_id]
Index: []

In [9]:
products_new.to_csv("data/products_new.csv", index=False)

# unnamed0: ref. https://stackoverflow.com/questions/36519086/how-to-get-rid-of-unnamed-0-column-in-a-pandas-dataframe

In [10]:
df = pd.read_csv("data/products_new.csv")
df.head()

,product_id,new_product_name,aisle_id,department_id
0,1,Chocolate Sandwich Cookies,61,19
1,2,All Seasons Salt,104,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1
4,5,Green Chile Anytime Sauce,5,13

In [ ]:
products[products.product_name.str.contains(',|\"')]